package com.zzu.ehome.ehomefordoctor.utils;

import android.text.TextUtils;

/**
 * Created by Administrator on 2016/10/28.
 */

public class CheckUtils {
    /**
     * 验证手机格式
     */
    public static boolean isMobileNO(String mobiles) {
        /*
		 * 移动：134、135、136、137、138、139、150、151、157(TD)、158、159、187、188
		 * 联通：130、131、132、152、155、156、185、186 电信：133、153、180、189、（1349卫通）
		 * 总结起来就是第一位必定为1，第二位必定为3或5或8，其他位置的可以为0-9
		 * (^1(3[0-9]|4[57]|5[0-35-9]|8[0-9])\\d{8}$)|(^170[059]\\d{7}$)
		 */
        /**
         * 手机号码:
         * 13[0-9], 14[5,7], 15[0, 1, 2, 3, 5, 6, 7, 8, 9], 17[6, 7, 8], 18[0-9], 170[0, 5, 9]
         * 移动号段: 134,135,136,137,138,139,150,151,152,157,158,159,182,183,184,187,188,147,178,1705
         * 联通号段: 130,131,132,155,156,185,186,145,176,1709
         * 电信号段: 133,153,180,181,189,177,1700
         */
        String mobile = "(^1(3[0-9]|4[57]|5[0-35-9]|8[0-9])\\d{8}$)|(^170[059]\\d{7}$)";
        /**
         * 中国移动：China Mobile
         * 134,135,136,137,138,139,150,151,152,157,158,159,182,183,184,187,188,147,178,1705
         */
        String cm = "(^1(3[4-9]|4[7]|5[0-27-9]|7[8]|8[2-478])\\d{8}$)|(^1705\\d{7}$)";
        /**
         * 中国联通：China Unicom
         * 130,131,132,155,156,185,186,145,176,1709
         */
        String cu = "(^1(3[0-2]|4[5]|5[56]|7[6]|8[56])\\d{8}$)|(^1709\\d{7}$)";
        /**
         * 中国电信：China Telecom
         * 133,153,180,181,189,177,1700
         */
        String ct = "(^1(33|53|77|8[019])\\d{8}$)|(^1700\\d{7}$)";
//		String telRegex = "^1(3[0-9]|4[57]|5[0-35-9]|8[0-9])\\\\d{8}$)|(^170[059]\\\\d{7}$";/
        if (TextUtils.isEmpty(mobiles))
            return false;
        else if (mobiles.matches(mobile) || mobiles.matches(cm) || mobiles.matches(cu) || mobiles.matches(ct)) {
            return true;
        } else {
            return false;
        }

    }
}
